
## Plan Result




<pre><code>Plan: 6 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * module.create-updates-queue-premium.azurerm_servicebus_queue.servicebus_queue
  * module.create-updates-queue-premium.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.create-updates-queue-premium.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.update-case-queue-premium.azurerm_servicebus_queue.servicebus_queue
  * module.update-case-queue-premium.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.update-case-queue-premium.azurerm_servicebus_queue_authorization_rule.send_auth_rule
* Update
  * azurerm_key_vault_secret.create_updates_queue_listen_conn_str
  * azurerm_key_vault_secret.create_updates_queue_send_conn_str
  * azurerm_key_vault_secret.update_case_queue_listen_conn_str
  * azurerm_key_vault_secret.update_case_queue_send_conn_str
  * azurerm_resource_group.rg
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.create_updates_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_listen_conn_str" {
        id             = "https://ethos-shared-aat.vault.azure.net/secrets/create-updates-queue-listen-connection-string/e47521374eed46f8a85bc482375748ca"
        name           = "create-updates-queue-listen-connection-string"
        tags           = {}
      ~ value          = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.create_updates_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_send_conn_str" {
        id             = "https://ethos-shared-aat.vault.azure.net/secrets/create-updates-queue-send-connection-string/7c5f61b336ba4fb4966ccf931f3ef6e3"
        name           = "create-updates-queue-send-connection-string"
        tags           = {}
      ~ value          = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.update_case_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_listen_conn_str" {
        id             = "https://ethos-shared-aat.vault.azure.net/secrets/update-case-queue-listen-connection-string/c4ffeff75f844cccb70345414d319eae"
        name           = "update-case-queue-listen-connection-string"
        tags           = {}
      ~ value          = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.update_case_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_send_conn_str" {
        id             = "https://ethos-shared-aat.vault.azure.net/secrets/update-case-queue-send-connection-string/602aca195e1e4bf1ac7152af9bac6eb1"
        name           = "update-case-queue-send-connection-string"
        tags           = {}
      ~ value          = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat"
        name     = "ethos-aat"
      ~ tags     = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#ethos-repl-service"
          - "application"  = "ethos"
          - "builtFrom"    = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
          - "businessArea" = "CFT"
          - "environment"  = "staging"
          - "lastUpdated"  = "2023-05-04T09:27:15Z"
          - "managedBy"    = "ECM Project"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.create-updates-queue-premium.azurerm_servicebus_queue.servicebus_queue will be created
  + resource "azurerm_servicebus_queue" "servicebus_queue" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + dead_lettering_on_message_expiration    = true
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT59M"
      + enable_batched_operations               = true
      + enable_express                          = false
      + enable_partitioning                     = false
      + id                                      = (known after apply)
      + lock_duration                           = "PT5M"
      + max_delivery_count                      = 10
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "create-updates-premium"
      + namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-aat-premium"
      + requires_duplicate_detection            = true
      + requires_session                        = false
      + status                                  = "Active"
    }

  # module.create-updates-queue-premium.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.create-updates-queue-premium.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "SendSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat|ethos-shared-aat"
        name                       = "ethos-shared-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (1 unchanged block hidden)
    }

  # module.update-case-queue-premium.azurerm_servicebus_queue.servicebus_queue will be created
  + resource "azurerm_servicebus_queue" "servicebus_queue" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + dead_lettering_on_message_expiration    = true
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT59M"
      + enable_batched_operations               = true
      + enable_express                          = false
      + enable_partitioning                     = false
      + id                                      = (known after apply)
      + lock_duration                           = "PT5M"
      + max_delivery_count                      = 10
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "update-case-premium"
      + namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-aat-premium"
      + requires_duplicate_detection            = true
      + requires_session                        = false
      + status                                  = "Active"
    }

  # module.update-case-queue-premium.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.update-case-queue-premium.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "SendSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

Plan: 6 to add, 6 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule has changed
  ~ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/create-updates/authorizationRules/ListenSharedAccessKey"
        name                        = "ListenSharedAccessKey"
      ~ primary_connection_string   = (sensitive value)
      ~ secondary_connection_string = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule has changed
  ~ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/create-updates/authorizationRules/SendSharedAccessKey"
        name                        = "SendSharedAccessKey"
      ~ primary_connection_string   = (sensitive value)
      ~ secondary_connection_string = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat|ethos-shared-aat"
        name                       = "ethos-shared-aat"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (1 unchanged block hidden)
    }

  # module.queue-namespace.azurerm_servicebus_namespace.servicebus_namespace has changed
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat"
        name                                = "ethos-servicebus-aat"
        tags                                = {
            "Destroy Me"   = "No"
            "Team Contact" = "#ethos-repl-service"
            "application"  = "ethos"
            "builtFrom"    = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
            "businessArea" = "CFT"
            "environment"  = "staging"
            "managedBy"    = "ECM Project"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.queue-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule has changed
  ~ resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/AuthorizationRules/SendAndListenSharedAccessKey"
        name                        = "SendAndListenSharedAccessKey"
      ~ primary_connection_string   = (sensitive value)
      ~ secondary_connection_string = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.servicebus-namespace-premium.azurerm_servicebus_namespace.servicebus_namespace has changed
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-aat-premium"
        name                                = "ethos-aat-premium"
        tags                                = {
            "BuiltFrom"           = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
            "application"         = "ethos"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#ethos-repl-service"
            "environment"         = "staging"
            "managedBy"           = "Ethos Replacement"
        }
        # (6 unchanged attributes hidden)
    }

  # module.servicebus-namespace-premium.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule has changed
  ~ resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-aat-premium/AuthorizationRules/SendAndListenSharedAccessKey"
        name                              = "SendAndListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule has changed
  ~ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/update-case/authorizationRules/ListenSharedAccessKey"
        name                        = "ListenSharedAccessKey"
      ~ primary_connection_string   = (sensitive value)
      ~ secondary_connection_string = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule has changed
  ~ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/update-case/authorizationRules/SendSharedAccessKey"
        name                        = "SendSharedAccessKey"
      ~ primary_connection_string   = (sensitive value)
      ~ secondary_connection_string = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":25,"Program":"tfcmt","SHA1":"","Vars":{}} -->